#define  _CRT_SECURE_NO_WARNINGS
#include <stdio.h>



//算数操作符
	//+ - * / %
	//整型除法 1/2 --> 0
	//浮点型除法 1.0/2 --> 0.5 最少有一个位浮点数
	//取模操作符% 两端必须是整数

//移位操作符：只针对整数
	// << 左移操作符
	// >> 右移操作符
	//移动的是二进制位

		//整数的二进制表示有3种
		//原码
		//反码
		//补码

		//正的整数的原码、反码、补码相同
		//负的整数的原码、反码、补码是要计算的
		//例如：7 整型4字节，32个比特位
		//00000000 00000000 00000000 00000111 -原码
		//00000000 00000000 00000000 00000111 -反码
		//00000000 00000000 00000000 00000111 -补码
		//-7
		//10000000 00000000 00000000 00000111 -原码（最高位是1就是负数，最高位是0就是正数）
		//11111111 11111111 11111111 11111000 -反码（原码的符号位不变，其他位取反就是补码）
		//11111111 11111111 11111111 11111001 -补码（反码+1就是补码）
		//补码的补码就是原码
		//整数在内存中存储的是补码

	//左移操作符：左边丢弃，右边补0
	//左移操作符有乘2的效果
	//右移操作符：
	//算数右移：右边丢弃，左边补原符号位
	//逻辑右移 ：右边丢弃，左边补0
	//VS编译器采用算数右移

//位操作符
// & 按（2进制）位与 同时为1才为1
// | 按（2进制）位或 有1就为1
// ^ 按(2进制)位异或 相同为0，相异为1
	// a^a=0
	// 0^a=a
	//异或操作符支持交换律
/*int main()
{
	int a = 3;
	int b = -5;
	int c1 = a & b;
	int c2 = a | b;
	int c3 = a ^ b;
	//00000000 00000000 00000000 00000011 - 3的补码
	
	//10000000 00000000 00000000 00000101 - -5的原码
	//11111111 11111111 11111111 11111010 - -5的反码
	//11111111 11111111 11111111 11111011 - -5的补码

	//00000000 00000000 00000000 00000011 - 3与-5的按位与之后的补码：3
 
	//11111111 11111111 11111111 11111011 - 3与-5的按位或之后的补码
	//11111111 11111111 11111111 11111010 反码
	//10000000 00000000 00000000 00000101 原码：-3

	//11111111 11111111 11111111 11111000 - 3与-5按位异或之后的补码
	//11111111 11111111 11111111 11110111 反
	//10000000 00000000 00000000 00001000 原：-8

	printf("%d\n", c1);
	printf("%d\n", c2);
	printf("%d\n", c3);

	return 0;
}*/

//不用中间变量交换整数a和b
int main()
{
	int a = 3;
	int b = 5;

	a = a ^ b;//a=3^5
	b = a ^ b;//b=3^5^5=3
	a = a ^ b;//a=3^5^3=5

	return 0;
}
//求一个整数存储在内存中的二进制1的个数
	